module.exports.pinker = 
{
    modulename:'pinker',
    //admin
    name:'👙 پینکر', 
    back:'⤴️ برگشت به پینکر',
    readSym: ['📪','📭'],
    pinkerDeleteAll: 'حذف تمام پینک ها',
    settings : '⚙️' + ' - ' + 'تنظیمات',
    backsetting: '⤴️ برگشت به ' + '⚙️' + ' - ' + 'تنظیمات',

    //user
    lable:'📨 ارسال پیام',
    getmess :'لطفا پیغام خود را ارسال کنید.',

    btn_user: {
        sendPink:'💏ارسال پینک🏖',
        connectToPinker:'👙اتصال به پینکر💒'
    },

    btn_settings:{
        pinkTemplate:'قالب نمونه پینک',
        connectToPinker:'پیام اخطار اتصال به پینکر',
    },

    query : {
        pinker : 'pi',
        user   : 'us',
        answer : 'ans',
        delete: 'delt',
    },

    mess : {
      answer : 'لطفا متن پاسخ را ارسال کنید، در پایان متن ارسال شده از طرف کاربر به پاسخ پیوست می شود.',
      pinkTemplate:'لطفا قالب مورد نظر خود را ارسال کنید، این قالب هنگام ارسال پین به کاربر نمایش داده میشود. ایدی ربات به صورت اتوماتیک اضافه می شود.',
      connectToPinker:'لطفا پیام اخطار را ارسال کنید، این پیام در هنگام اتصال به یک پینکر برای کاربر نمایش داده می شود.',
      getPink:'🔵پینکر عزیز پیام خودتو برای ربات بفرست:',
      getPinkerid:'🔸برای اتصال به پینکر ، "🎈 پینکر کد" مخصوص او را برای ربات بدون هیچ فاصله و کاراکتر اضافه و با کیبرد انگلیسی بفرستید.🔸',
      getPinkerText:'پیام خود را ارسال کنید. این پیام بدون قابلیت فرواردی (یعنی طرف مقابل امکان دیدن پروفایل شما رو تا زمانی که ایدی خودتونو براش ارسال نکردید نداره) مستقیما به پینکر مورد نظر شما ارسال میگردد. \n\n 🔴پینکر قابلیت بلاک کردن پیام‌های مزاحمت آمیز را دارد. ربات به طور خودکار اکانتی که ۳ بار بلاک شود را از لیست کاربران خود حذف میکند. پس لطفا خود از ایجاد مزاحمت برای افراد بپرهیزید.',
      answerDone:'✅ ' + 'پیام شما ارسال شد. پینکر در صورت تمایل ، به پیام شما پاسخ میدهد.',
      pinkDone:'پیام شما برای ادمین ربات ارسال شد و پس از تایید ادمین در کانال به اشتراک گذاشته میشود.🙇‍♂🙇‍♀',
      answerTo:'لطفا جواب خودت رو ارسال کن.',
    },

    section: {
        createanswer : 'ca',
    }
}