module.exports.bag = {
    modulename:'bag',
    //admin
    name:'🏷💰 ' + 'لیست فاکتور ها', 
    back:'⤴️ برگشت به لیست فاکتور ها',
    readSym: ['📪','📭'],
    settings : '⚙️' + ' - ' + 'تنظیمات',
    backsetting: '⤴️ برگشت به ' + '⚙️' + ' - ' + 'تنظیمات',
    factors :'لیست فاکتور ها',

    f_peied     : '✅',
    f_notpaid  : '☑️',

    //factor types
    factorTypes : {
        post:'post'
    },

    //user
    btns_user:{
        bagshop: '🛍 ' + 'سبد خرید',
        myProducts: '🛍 ' + 'خرید های من',
        factor: '🏷 ' + 'فاکتور ها',
    },

    query : {
        bag : 'bag',
        user : 'user',
        submitbag: 'submitbag',
        clearbag: 'clearbag',
        deletefactor: 'deletef',
        itemsdetail: 'itmdtl',
        close: 'close',
        getpaid: 'getpaid',
        addToBag:'addToBag',
    },

    mess : {
      answer : 'لطفا متن پاسخ را ارسال کنید، در پایان متن ارسال شده از طرف کاربر به پاسخ پیوست می شود.',
      editbag:'⚠️ ' + 'لطفا برای حذف آیتم ها از کلید های زیر استفاده کنید.',
      notafactor:'همچین فاکتوری وجود ندارد لطفا از گزینه های زیر استفاده کنید.',
      alreadyAdded:'شما قبلا این محصول را به سبد خرید خود اضافه کرده اید.',
    }
}