module.exports.bag = {
    modulename:'bag',
    //admin
    name:'🏷💰 ' + 'لیست فاکتور ها', 
    back:'⤴️ برگشت به لیست فاکتور ها',
    readSym: ['📪','📭'],
    settings : '⚙️' + ' - ' + 'تنظیمات',
    backsetting: '⤴️ برگشت به ' + '⚙️' + ' - ' + 'تنظیمات',

    f_peied     : '✅',
    f_notpaid  : '☑️',

    //factor types
    factorTypes : {
        post:'post'
    },

    btns: {
        nextpay:'کلید api نکست پی',
    },

    //user
    btns_user:{
        bagshop: '🛍 ' + 'سبد خرید',
        myProducts: '🛍 ' + 'خرید های من',
        factor: '🏷 ' + 'فاکتور ها',
    },

    query : {
        bag : 'bag',
        user : 'user',
        submitbag: 'submitbag',
        clearbag: 'clearbag',
        deletefactor: 'deletef',
        itemsdetail: 'itmdtl',
        close: 'close',
        getpaid: 'getpaid',
        addToBag:'addToBag',
        address:'address',
        phone:'phone',
        postalInfo:'postalInfo',
    },

    mess : {
      answer : 'لطفا متن پاسخ را ارسال کنید، در پایان متن ارسال شده از طرف کاربر به پاسخ پیوست می شود.',
      editbag:'⚠️ ' + 'لطفا برای حذف آیتم ها از کلید های زیر استفاده کنید.',
      notafactor:'همچین فاکتوری وجود ندارد لطفا از گزینه های زیر استفاده کنید.',
      alreadyAdded:'شما قبلا این محصول را به سبد خرید خود اضافه کرده اید.',
      getAddress:'لطفا آدرس پستی خود را به همراه کد پستی را ارسال کنید. \n نکته: کد پستی جهت سهلت در پروسه پست و تحویل کالا است و بهتر است آن را به همران آدرس پستی خود بنویسید.',
      getPhone:'لطفا از طریق دکمه زیر اجازه دهید شماره موبایل شما برای ما ارسال شود. \n برای سهولت در امر پست و تحویل کالا دسترسی به شماره تماس شما لازم است.',
      getnextpayapikey:'لطفا کلید api درگاه نکست پی را ارسال کنید.'
    }
}